load extension sql

In [2]:
%load_ext sql
%sql mysql://root:root@localhost/testing_system_db

In [5]:
%%sql
SHOW TABLES;

 * mysql://root:***@localhost/testing_system_db
16 rows affected.

[('account',),
 ('answer',),
 ('brown_questions',),
 ('categoryquestion',),
 ('department',),
 ('eng_dept_view',),
 ('exam',),
 ('examquestion',),
 ('group',),
 ('groupaccount',),
 ('long_question',),
 ('most_acc_dept',),
 ('most_joining_acc',),
 ('position',),
 ('question',),
 ('typequestion',)]

# Question 1. Tạo Store để User nhập vào tên Phòng ban và in ra tất cả các Account thuộc phòng ban đó

In [26]:
%%sql
SELECT  a.*, d.DepartmentName
FROM    account     AS a
JOIN    department  AS d    ON   d.DepartmentID = a.DepartmentID
WHERE   d.DepartmentName = N'Engineering';

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(2, 'john12@gmail.com', 'john_doe', 'John Doe', 1, 1, datetime.datetime(2024, 2, 20, 0, 0), 'Engineering'),
 (6, 'sarah89@gmail.com', 'sarah_wilson', 'Sarah Wilson', 1, 6, datetime.datetime(2024, 3, 1, 0, 0), 'Engineering'),
 (7, 'christopher_lee123@yahoo.com', 'christopher_lee', 'Christopher Lee', 1, 6, datetime.datetime(2024, 3, 1, 0, 0), 'Engineering'),
 (15, 'alice.smith456@hotmail.com', 'alice_smith', 'Alice Smith', 1, 6, datetime.datetime(2024, 5, 15, 0, 0), 'Engineering'),
 (16, 'bob.jones789@protonmail.com', 'bob_jones', 'Bob Jones', 1, 6, datetime.datetime(2024, 5, 16, 0, 0), 'Engineering')]

Tạo store procedure (sp) để lấy tài khoản (GetAccount) từ phòng ban nhập vào (IN: FromDept)

In [30]:
%%sql
USE testing_system_db;
DROP PROCEDURE IF EXISTS sp_GetAccountFromDept;

CREATE PROCEDURE sp_GetAccountFromDept(
    IN in_dept_name VARCHAR(50)
)
BEGIN
    SELECT  a.*
    FROM    `Account`   AS a
    JOIN    department  AS d
    ON      d.DepartmentID = a.DepartmentID
    WHERE   d.DepartmentName = in_dept_name;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [ ]:
%%sql
CALL sp_GetAccountFromDept('Engineering');

pip install mysqlclient

In [14]:
import MySQLdb

# Thiết lập kết nối đến cơ sở dữ liệu
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

# Gọi stored procedure
cursor.callproc('sp_GetAccountFromDept', ('Engineering',))
results = cursor.fetchall()

# In kết quả
for record in results:
    print(record)

# Đóng kết nối
cursor.close()
conn.close()

(2, 'john12@gmail.com', 'john_doe', 'John Doe', 1, 1, datetime.datetime(2024, 2, 20, 0, 0))
(6, 'sarah89@gmail.com', 'sarah_wilson', 'Sarah Wilson', 1, 6, datetime.datetime(2024, 3, 1, 0, 0))
(7, 'christopher_lee123@yahoo.com', 'christopher_lee', 'Christopher Lee', 1, 6, datetime.datetime(2024, 3, 1, 0, 0))
(15, 'alice.smith456@hotmail.com', 'alice_smith', 'Alice Smith', 1, 6, datetime.datetime(2024, 5, 15, 0, 0))
(16, 'bob.jones789@protonmail.com', 'bob_jones', 'Bob Jones', 1, 6, datetime.datetime(2024, 5, 16, 0, 0))

# Question 2: Tạo Store để in ra số lượng Account trong mỗi Group

In [22]:
%%sql
SELECT      g.GroupID, g.groupName, COUNT(ga.AccountID) AS NUM_ACCOUNT
FROM        GroupAccount    AS  ga
RIGHT JOIN  `Group`         AS  g   ON  g.GroupID = ga.GroupID
GROUP BY    g.GroupName
ORDER BY    NUM_ACCOUNT;

 * mysql://root:***@localhost/testing_system_db
9 rows affected.

[(9, 'Analyst Team', 0),
 (7, 'Finance Team', 2),
 (5, 'Marketing Team', 2),
 (6, 'HR Team', 3),
 (3, 'ENG Team', 5),
 (1, 'Management Team', 5),
 (8, 'ENG_Help Team', 6),
 (4, 'Operations Team', 7),
 (2, 'HR Support', 15)]

In [23]:
%%sql
DROP    PROCEDURE IF EXISTS sp_CountAccountsInGroups;
CREATE  PROCEDURE           sp_CountAccountsInGroups()
BEGIN
    SELECT      g.GroupID, g.groupName, COUNT(ga.AccountID) AS NUM_ACCOUNT
    FROM        GroupAccount    AS  ga
    RIGHT JOIN  `Group`         AS  g   ON  g.GroupID = ga.GroupID
    GROUP BY    g.GroupName
    ORDER BY    NUM_ACCOUNT;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

# Question 3: Tạo Store để thống kê mỗi Type question có bao nhiêu Question được tạo trong tháng hiện tại

In [28]:
%%sql
SELECT      tq.TypeName, q.CreateDate, q.QuestionID
FROM        Question        AS q
RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
WHERE       YEAR(q.CreateDate) = 2024
AND         MONTH(q.CreateDate) = 4;

 * mysql://root:***@localhost/testing_system_db
10 rows affected.

[('Essay', datetime.datetime(2024, 4, 1, 0, 0), 10),
 ('Essay', datetime.datetime(2024, 4, 1, 0, 0), 11),
 ('Essay', datetime.datetime(2024, 4, 20, 0, 0), 12),
 ('Essay', datetime.datetime(2024, 4, 20, 0, 0), 14),
 ('Essay', datetime.datetime(2024, 4, 22, 0, 0), 15),
 ('Essay', datetime.datetime(2024, 4, 26, 0, 0), 17),
 ('Multiple-Choice', datetime.datetime(2024, 4, 1, 0, 0), 9),
 ('Multiple-Choice', datetime.datetime(2024, 4, 20, 0, 0), 13),
 ('Multiple-Choice', datetime.datetime(2024, 4, 25, 0, 0), 16),
 ('Multiple-Choice', datetime.datetime(2024, 4, 26, 0, 0), 18)]

In [27]:
%%sql
SELECT      tq.TypeName, COUNT(q.QuestionID)
FROM        Question        AS q
RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
WHERE       YEAR(q.CreateDate) = 2024
AND         MONTH(q.CreateDate) = 4
GROUP BY    tq.TypeName;

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[('Essay', 6), ('Multiple-Choice', 4)]

In [29]:
%%sql
DROP    PROCEDURE IF EXISTS sp_CountQuestionByTypeAndTime;
CREATE  PROCEDURE           sp_CountQuestionByTypeAndTime(IN year_input INT, IN month_input INT)
BEGIN
        SELECT      tq.TypeName, COUNT(q.QuestionID)
        FROM        Question        AS q
        RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
        WHERE       YEAR(q.CreateDate)  = year_input
        AND         MONTH(q.CreateDate) = month_input
        GROUP BY    tq.TypeName;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [31]:
%%sql
DROP    PROCEDURE IF EXISTS sp_CountQuestionByTypeAndCurrentMonth;
CREATE  PROCEDURE           sp_CountQuestionByTypeAndCurrentMonth()
BEGIN
        SELECT      tq.TypeName, COUNT(q.QuestionID)
        FROM        Question        AS q
        RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
        WHERE       YEAR(q.CreateDate)  = YEAR(NOW())
        AND         MONTH(q.CreateDate) = MONTH(NOW())
        GROUP BY    tq.TypeName;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [ ]:
%%sql
DROP    PROCEDURE IF EXISTS sp_CountQuestionByTypeAndCurrentMonth;
CREATE  PROCEDURE           sp_CountQuestionByTypeAndCurrentMonth()
BEGIN
        DECLARE     current_year    INT;
        DECLARE     current_month   INT;

        SET         current_year    = YEAR(NOW());
        SET         current_month   = MONTH(NOW());

        SELECT      tq.TypeName, COUNT(q.QuestionID)
        FROM        Question        AS q
        RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
        WHERE       YEAR(q.CreateDate)  = current_year
        AND         MONTH(q.CreateDate) = current_month 
        GROUP BY    tq.TypeName;
END;

# Question 4: Tạo Store để trả ra Id của Type question có nhiều Câu hỏi nhất

In [35]:
%%sql
SELECT      tq.TypeName, COUNT(q.QuestionID)
FROM        Question        AS q
RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
GROUP BY    tq.TypeName;

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[('Essay', 11), ('Multiple-Choice', 7)]

In [37]:
%%sql
SELECT      MAX(NUM_Q)
FROM        (
            SELECT      COUNT(q.QuestionID) AS NUM_Q
            FROM        Question            AS q
            RIGHT JOIN  TypeQuestion        AS tq   ON tq.TypeID = q.TypeID
            GROUP BY    tq.TypeName
            ) AS CountQuestion;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(11,)]

In [49]:
%%sql
SELECT      tq.TypeID
FROM        Question        AS q
RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
GROUP BY    tq.TypeName
HAVING      COUNT(q.QuestionID) = (
                                    SELECT      MAX(NUM_Q)
                                    FROM        (
                                                SELECT      COUNT(q.QuestionID) AS NUM_Q
                                                FROM        Question            AS q
                                                RIGHT JOIN  TypeQuestion        AS tq   ON tq.TypeID = q.TypeID
                                                GROUP BY    tq.TypeName
                                                ) AS CountQuestion
                                    );

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(1,)]

In [52]:
%%sql
DROP    PROCEDURE IF EXISTS sp_GetTypeIdWithMostQuestions;
CREATE  PROCEDURE           sp_GetTypeIdWithMostQuestions()
BEGIN   
        DECLARE v_MaxQuestionCount      INT;
        DECLARE v_TypeIDWithMaxQuestion INT;

        SELECT      MAX(NUM_Q)  INTO v_MaxQuestionCount
        FROM        (
                    SELECT      COUNT(q.QuestionID) AS NUM_Q
                    FROM        Question            AS q
                    RIGHT JOIN  TypeQuestion        AS tq   ON tq.TypeID = q.TypeID
                    GROUP BY    tq.TypeName
                    ) AS CountQuestion;
        
        SELECT      tq.TypeID   INTO v_TypeIDWithMaxQuestion
        FROM        Question        AS q
        RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
        GROUP BY    tq.TypeName
        HAVING      COUNT(q.QuestionID) = v_MaxQuestionCount;

        SELECT      v_TypeIDWithMaxQuestion;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

# Question 5: Sử dụng Store ở Question-4 để tìm ra tên của Type question

In [60]:
%%sql
DROP    PROCEDURE IF EXISTS sp_GetTypeIdWithMostQuestions;
CREATE  PROCEDURE           sp_GetTypeIdWithMostQuestions(OUT v_TypeIDWithMaxQuestion INT)
BEGIN   
        DECLARE v_MaxQuestionCount      INT;

        SELECT      MAX(NUM_Q)  INTO v_MaxQuestionCount
        FROM        (
                    SELECT      COUNT(q.QuestionID) AS NUM_Q
                    FROM        Question            AS q
                    RIGHT JOIN  TypeQuestion        AS tq   ON tq.TypeID = q.TypeID
                    GROUP BY    tq.TypeName
                    ) AS CountQuestion;
        
        SELECT      tq.TypeID   INTO v_TypeIDWithMaxQuestion
        FROM        Question        AS q
        RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
        GROUP BY    tq.TypeName
        HAVING      COUNT(q.QuestionID) = v_MaxQuestionCount;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [66]:
%%sql
CALL sp_GetTypeIdWithMostQuestions(@v_TypeIDWithMaxQuestion);

SELECT  TypeName
FROM    TypeQuestion
WHERE   TypeID = @v_TypeIDWithMaxQuestion;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.
1 rows affected.

[('Essay',)]

Vấn đề là tôi không nhớ tên biến OUT của sp nên tôi sẽ gọi bằng một tên khác

In [65]:
%%sql
CALL sp_GetTypeIdWithMostQuestions(@TypeID);

SELECT  TypeName
FROM    TypeQuestion
WHERE   TypeID = @TypeID;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.
1 rows affected.

[('Essay',)]

# Question 6: Viết 1 Store cho phép User nhập vào 1 chuỗi và trả về Group có tên chứa chuỗi đó hoặc trả về User có Username chứa chuỗi đó

In [10]:
%%sql
SELECT  GroupName, GroupID
FROM    `Group`
WHERE   GroupName LIKE  '%ma%';

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[('Management Team', 1), ('Marketing Team', 5)]

In [11]:
%%sql
SELECT  Username, AccountID
FROM    `Account`
WHERE   Username LIKE  '%ma%';

 * mysql://root:***@localhost/testing_system_db
4 rows affected.

[('amanda_thompson', 11),
 ('ashley_martinez', 13),
 ('emma_taylor', 8),
 ('ryan_martinez', 19)]

In [22]:
%%sql
DROP    PROCEDURE   IF EXISTS   sp_SearchGroupOrUser;
CREATE  PROCEDURE               sp_SearchGroupOrUser(IN search_string NVARCHAR(255))
BEGIN
    DECLARE found_group INT DEFAULT 0;
    DECLARE found_user  INT DEFAULT 0;

    SELECT  COUNT(*)    INTO found_group
    FROM    `Group`
    WHERE   GroupName   LIKE  CONCAT('%', search_string,'%');

    SELECT  COUNT(*)    INTO found_user
    FROM    `Account`
    WHERE   Username    LIKE  CONCAT('%', search_string,'%');

    IF  found_group > 0 THEN
        SELECT  'Group' AS ResultType, GroupName, GroupID
        FROM    `Group`
        WHERE   GroupName   LIKE  CONCAT('%', search_string,'%');
    END IF;

    IF  found_user  > 0 THEN
        SELECT  'User'  AS ResultType, Username, AccountID
        FROM    `Account`
        WHERE   Username    LIKE  CONCAT('%', search_string,'%');
    END IF;

    IF  found_group = 0 AND found_user = 0 THEN
        SELECT 'No match found' AS ResultType;
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [25]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

search_string = 'ma'

cursor.callproc('sp_SearchGroupOrUser', [search_string])

while True:
    result = cursor.fetchall()
    for row in result:
        print(row)
    if not cursor.nextset():
        break

cursor.close()
conn.close()

('Group', 'Management Team', 1)
('Group', 'Marketing Team', 5)
('User', 'amanda_thompson', 11)
('User', 'ashley_martinez', 13)
('User', 'emma_taylor', 8)
('User', 'ryan_martinez', 19)

Do cả Group và User đều có kết quả khớp với chuỗi tìm kiếm, nên hai tập kết quả riêng biệt sẽ được trả về liên tiếp (Result 1, Result 2)

In [11]:
%%sql
SELECT 'Group' AS ResultType, g.GroupName, g.GroupID, NULL AS AccountID, NULL AS Username 
FROM `Group` AS g 
WHERE g.GroupName LIKE CONCAT('%', 'ma', '%')

UNION ALL

SELECT 'User' AS ResultType, NULL AS GroupName, NULL AS GroupID, a.AccountID, a.Username
FROM `Account` AS a 
WHERE a.Username LIKE CONCAT('%', 'ma', '%');

 * mysql://root:***@localhost/testing_system_db
6 rows affected.

[('Group', 'Management Team', 1, None, None),
 ('Group', 'Marketing Team', 5, None, None),
 ('User', None, None, 11, 'amanda_thompson'),
 ('User', None, None, 13, 'ashley_martinez'),
 ('User', None, None, 8, 'emma_taylor'),
 ('User', None, None, 19, 'ryan_martinez')]

In [12]:
%%sql
DROP    PROCEDURE   IF EXISTS   sp_SearchGroupOrUser2;
CREATE  PROCEDURE               sp_SearchGroupOrUser2(IN search_string NVARCHAR(255))
BEGIN
    SELECT 'Group' AS ResultType, g.GroupName, g.GroupID, NULL AS AccountID, NULL AS Username 
    FROM `Group` AS g 
    WHERE g.GroupName LIKE CONCAT('%', 'ma', '%')

    UNION ALL

    SELECT 'User' AS ResultType, NULL AS GroupName, NULL AS GroupID, a.AccountID, a.Username
    FROM `Account` AS a 
    WHERE a.Username LIKE CONCAT('%', 'ma', '%');
    
    IF ROW_COUNT() = 0 THEN
        SELECT 'No match found' AS ResultType, NULL AS Name, NULL AS ID, NULL AS AccountID, NULL AS Username;
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [14]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

search_string = 'ma'

cursor.callproc('sp_SearchGroupOrUser2', [search_string])

result = cursor.fetchall()
for record in result:
    print(record)

cursor.close()
conn.close()

('Group', 'Management Team', 1, None, None)
('Group', 'Marketing Team', 5, None, None)
('User', None, None, 11, 'amanda_thompson')
('User', None, None, 13, 'ashley_martinez')
('User', None, None, 8, 'emma_taylor')
('User', None, None, 19, 'ryan_martinez')

# Question 7: Viết 1 Store cho phép User nhập vào thông tin FullName, Email

Store sẽ tự động gán:
- username sẽ giống email nhưng bỏ phần @..mail đi
- positionID: sẽ có default là Operator
- departmentID: sẽ được cho vào 1 phòng chờ

Sau đó in ra kết quả tạo thành công

In [18]:
%%sql
SELECT  *
FROM    Account
LIMIT   0;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

In [20]:
%%sql
SELECT  Email, SUBSTRING_INDEX(Email, '@', 1)
FROM    Account
LIMIT   1;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[('alice.smith456@hotmail.com', 'alice.smith456')]

In [22]:
%%sql
SELECT  *
FROM    `Position`
WHERE   PositionName = 'Operator';

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(11, 'Operator')]

In [8]:
%%sql    
INSERT INTO Department (DepartmentName)
SELECT 'Phòng chờ'
FROM dual
WHERE NOT EXISTS (
    SELECT 1
    FROM Department
    WHERE DepartmentName = 'Phòng chờ'
);

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

In [11]:
%%sql
DROP    PROCEDURE IF EXISTS sp_CreateAccount;
CREATE  PROCEDURE           sp_CreateAccount(
        IN  p_FullName      NVARCHAR(50),
        IN  p_Email         VARCHAR(50)
)
BEGIN
    DECLARE v_Username      VARCHAR(50);
    DECLARE v_PositionID    TINYINT UNSIGNED;
    DECLARE v_PendingDepartmentID TINYINT UNSIGNED;

    SET     v_Username  = SUBSTRING_INDEX(p_Email, '@', 1);

    INSERT INTO Department (DepartmentName)
    SELECT 'Phòng chờ'
    FROM dual
    WHERE NOT EXISTS (
        SELECT 1
        FROM Department
        WHERE DepartmentName = 'Phòng chờ'
    );

    SELECT DepartmentID INTO v_PendingDepartmentID
    FROM `Department`
    WHERE DepartmentName = 'Phòng chờ';

    SELECT  PositionID INTO v_PositionID
    FROM    `Position`
    WHERE   PositionName = 'Operator';

    INSERT INTO `Account` (Email    , Username  , FullName  , DepartmentID          , PositionID    , CreateDate)
    VALUES                (p_Email  , v_Username, p_FullName, v_PendingDepartmentID , v_PositionID  , NOW()     );

    SELECT 'Account created successfully!' AS Message;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [15]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

cursor.callproc('sp_CreateAccount', ('Phan Trương Kiên', 'truongkien99@gmail.com',))

result = cursor.fetchall()
print(result)

while cursor.nextset():
    pass
conn.commit()

cursor.close()
conn.close()

(('Account created successfully!',),)

In [17]:
%%sql
DROP    PROCEDURE IF EXISTS sp_CreateAccount2;
CREATE  PROCEDURE           sp_CreateAccount2(
        IN  p_FullName      NVARCHAR(50),
        IN  p_Email         VARCHAR(50)
)
BEGIN
    DECLARE v_Username      VARCHAR(50);
    DECLARE v_PositionID    TINYINT UNSIGNED;
    DECLARE v_PendingDepartmentID TINYINT UNSIGNED;
    DECLARE v_AccountID INT;

    SET     v_Username  = SUBSTRING_INDEX(p_Email, '@', 1);

    INSERT INTO Department (DepartmentName)
    SELECT 'Phòng chờ'
    FROM    dual
    WHERE NOT EXISTS (
        SELECT 1
        FROM Department
        WHERE DepartmentName = 'Phòng chờ'
    );

    SELECT DepartmentID INTO v_PendingDepartmentID
    FROM `Department`
    WHERE DepartmentName = 'Phòng chờ';

    SELECT  PositionID INTO v_PositionID
    FROM    `Position`
    WHERE   PositionName = 'Operator';

    INSERT INTO `Account` (Email    , Username  , FullName  , DepartmentID          , PositionID    , CreateDate)
    VALUES                (p_Email  , v_Username, p_FullName, v_PendingDepartmentID , v_PositionID  , NOW()     );

    SELECT LAST_INSERT_ID() INTO v_AccountID;
    SELECT  *
    FROM    `Account`
    WHERE   AccountID = v_AccountID;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [18]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

cursor.callproc('sp_CreateAccount2', ('Đào Trọng Nhân', 'nhandao93@gmail.com',))

result = cursor.fetchall()
print(result)

while cursor.nextset():
    pass
conn.commit()

cursor.close()
conn.close()

((28, 'nhandao93@gmail.com', 'nhandao93', 'Đào Trọng Nhân', 8, 11, datetime.datetime(2024, 5, 22, 23, 58, 29)),)

# Question 8: Viết 1 Store cho phép User nhập vào Essay hoặc Multiple-Choice để thống kê câu hỏi nào có content dài nhất

In [7]:
%%sql
SELECT      tq.TypeName, q.Content, LENGTH(q.Content) AS LEN_CONTENT
FROM        Question        AS q
RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
WHERE       tq.TypeName = 'Essay'
ORDER BY    LEN_CONTENT DESC;

 * mysql://root:***@localhost/testing_system_db
11 rows affected.

[('Essay', 'Ứng dụng sơ đồ xương cá trong phân tích nguyên nnhân gốc rễ', 78),
 ('Essay', 'Kể tên những mối nguy về điện trong môi trường làm việc', 74),
 ('Essay', 'Quy định về việc trang bị đẩy đủ bảo hộ lao động', 70),
 ('Essay', 'Quy định về việc đăng ký tăng ca và số giờ tăng ca', 67),
 ('Essay', 'Quy định về nơi được phép hút thuốc trong công ty', 64),
 ('Essay', 'Kể tên những mối nguy về hóa chất có thể gặp', 61),
 ('Essay', 'Quy định về việc xin nghỉ phép, nghỉ ốm', 53),
 ('Essay', 'Công ty đang sản xuất những mặt hàng nào', 52),
 ('Essay', 'Các nguyên tắc trong sơ cấp cứu ban đầu', 51),
 ('Essay', 'Mục tiêu chất lượng của công ty là gì?', 51),
 ('Essay', 'Bạn biết gì về nguyên lý 80/20', 39)]

In [8]:
%%sql
SELECT      LENGTH(q.Content) AS LEN_CONTENT
FROM        Question        AS q
RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
WHERE       tq.TypeName = 'Essay'
ORDER BY    LEN_CONTENT DESC;

 * mysql://root:***@localhost/testing_system_db
11 rows affected.

[(78,), (74,), (70,), (67,), (64,), (61,), (53,), (52,), (51,), (51,), (39,)]

In [9]:
%%sql
SELECT  MAX(LEN_CONTENT)
FROM    (SELECT     LENGTH(q.Content) AS LEN_CONTENT
        FROM        Question        AS q
        RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
        WHERE       tq.TypeName = 'Essay'
        ORDER BY    LEN_CONTENT DESC
        ) AS LengthQuestion;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(78,)]

In [2]:
%%sql
DROP    PROCEDURE IF EXISTS sp_LongestQuestionByType;
CREATE  PROCEDURE           sp_LongestQuestionByType(IN search_type NVARCHAR(50))
BEGIN
    DECLARE v_max_len_question    INT;
    DECLARE v_result_question     NVARCHAR(255);

    SELECT  MAX(LEN_CONTENT) INTO v_max_len_question
    FROM    (SELECT     LENGTH(q.Content) AS LEN_CONTENT
            FROM        Question        AS q
            RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
            WHERE       tq.TypeName = search_type
            ORDER BY    LEN_CONTENT DESC
            ) AS LengthQuestion;
    
    SELECT      q.Content INTO v_result_question
    FROM        Question        AS q
    RIGHT JOIN  TypeQuestion    AS tq   ON tq.TypeID = q.TypeID
    WHERE       tq.TypeName         = search_type
    AND         LENGTH(q.Content)   = v_max_len_question;

    SELECT v_result_question;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [4]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

search_type = 'Essay'

cursor.callproc('sp_LongestQuestionByType', [search_type])

result = cursor.fetchall()
for record in result:
    print(record)

cursor.close()
conn.close()

('Ứng dụng sơ đồ xương cá trong phân tích nguyên nnhân gốc rễ',)

# Question 9: Viết 1 Store cho phép User xóa Exam dựa vào ID

In [3]:
%%sql
SELECT  *
FROm    Exam
LIMIT   1;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(1, 'VTIQ001', 'Đề thi An toàn 01', 2, 60, 2, datetime.datetime(2024, 3, 10, 0, 0))]

In [4]:
%%sql
INSERT INTO Exam    (`Code`     , Title          , CategoryID, Duration  , CreatorID , CreateDate )
VALUES              ('VTIQ012'  , N'Đề thi THỬ'  , 2         , 60        , 2         ,'2024-05-23');

INSERT INTO ExamQuestion    (ExamID , QuestionID)
VALUES                      (12     , 1         );

 * mysql://root:***@localhost/testing_system_db
1 rows affected.
1 rows affected.

[]

In [27]:
%%sql
DROP    PROCEDURE IF EXISTS sp_DeleteExamByID;
CREATE  PROCEDURE           sp_DeleteExamByID(
    IN  p_ExamID TINYINT UNSIGNED
)
BEGIN
    IF EXISTS (
                SELECT  1
                FROM    Exam
                WHERE   ExamID = p_ExamID
                ) 
        THEN
        DELETE
        FROM    Exam
        WHERE   ExamID = p_ExamID;

        SELECT CONCAT('Exam with ID ', p_ExamID, ' has been deleted!')   AS MESSAGE;
    ELSE
        SELECT CONCAT('No Exam found with ID ', p_ExamID)                AS MESSAGE;
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [29]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

cursor.callproc('sp_DeleteExamByID', (12,))

result = cursor.fetchall()
print(result)

while cursor.nextset():
    pass
conn.commit()

cursor.close()
conn.close()

(('Exam with ID 12 has been deleted!',),)

In [30]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

cursor.callproc('sp_DeleteExamByID', (12,))

result = cursor.fetchall()
print(result)

while cursor.nextset():
    pass
conn.commit()

cursor.close()
conn.close()

(('No Exam found with ID 12',),)

# Question 10: Tìm ra các Exam được tạo từ 3 năm trước và xóa các Exam đó đi (sử dụng Store ở câu 9 để xóa). Sau đó in số lượng Record đã remove từ các Table liên quan trong khi removing

In [3]:
%%sql
SELECT      *
FROM        Exam
ORDER BY    CreateDate
LIMIT       1;

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[(1, 'VTIQ001', 'Đề thi An toàn 01', 2, 60, 2, datetime.datetime(2024, 3, 10, 0, 0))]

In [36]:
%%sql
INSERT INTO Exam    (`Code`     , Title          , CategoryID, Duration  , CreatorID , CreateDate )
VALUES              ('VTIQ014'  , N'Đề thi THỬ'  , 2         , 60        , 2         ,'2020-01-02'),
                    ('VTIQ015'  , N'Đề thi THỬ'  , 2         , 60        , 2         ,'2020-10-15'),
                    ('VTIQ016'  , N'Đề thi THỬ'  , 2         , 60        , 2         ,'2021-02-12');

INSERT INTO ExamQuestion    (ExamID , QuestionID)
VALUES                      (14     , 1         ),
                            (15     , 1         ),
                            (16     , 1         );

 * mysql://root:***@localhost/testing_system_db
3 rows affected.
3 rows affected.

[]

In [38]:
%%sql
SELECT      *
FROM        Exam
WHERE       CreateDate < DATE_SUB(NOW(), INTERVAL 3 YEAR)

 * mysql://root:***@localhost/testing_system_db
4 rows affected.

[(13, 'VTIQ012', 'Đề thi THỬ', 2, 60, 2, datetime.datetime(2021, 1, 23, 0, 0)),
 (14, 'VTIQ014', 'Đề thi THỬ', 2, 60, 2, datetime.datetime(2020, 1, 2, 0, 0)),
 (15, 'VTIQ015', 'Đề thi THỬ', 2, 60, 2, datetime.datetime(2020, 10, 15, 0, 0)),
 (16, 'VTIQ016', 'Đề thi THỬ', 2, 60, 2, datetime.datetime(2021, 2, 12, 0, 0))]

# Question 11: Viết Store cho phép User xóa Phòng ban bằng cách nhập vào tên Phòng ban. Các Account thuộc phòng ban đã bị xóa sẽ được chuyển về phòng ban default là phòng ban chờ việc

In [4]:
%%sql
SELECT      d.DepartmentID, d.DepartmentName, COUNT(a.AccountID)
FROM        Department  AS d
RIGHT JOIN  Account     AS a    ON a.DepartmentID = d.DepartmentID
GROUP BY    d.DepartmentName;

 * mysql://root:***@localhost/testing_system_db
5 rows affected.

[(1, 'Engineering', 5),
 (2, 'Marketing', 2),
 (3, 'Human Resources', 3),
 (4, 'Finance', 2),
 (5, 'Operations', 7)]

In [5]:
%%sql
SELECT      d.DepartmentID, d.DepartmentName, a.AccountID
FROM        Department  AS d
RIGHT JOIN  Account     AS a    ON a.DepartmentID = d.DepartmentID
WHERE       d.DepartmentName = 'Finance';

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[(4, 'Finance', 5), (4, 'Finance', 13)]

Tạo ra Phòng ban Delete để lưu tạm các nhân viên của Finance chuyển vào:

In [6]:
%%sql
INSERT INTO Department (DepartmentName  ) 
VALUES				   ('Delete'        );

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [7]:
%%sql
SELECT      d.DepartmentID, d.DepartmentName, a.AccountID
FROM        Department  AS d
RIGHT JOIN  Account     AS a    ON a.DepartmentID = d.DepartmentID
WHERE       d.DepartmentName = 'Delete';

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

Chuyển các nhân viên phòng Finance vào phòng Delete:

In [8]:
%%sql
UPDATE  Account
SET     DepartmentID = 6
WHERE   DepartmentID = 4;

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[]

In [9]:
%%sql
SELECT      d.DepartmentID, d.DepartmentName, a.AccountID
FROM        Department  AS d
RIGHT JOIN  Account     AS a    ON a.DepartmentID = d.DepartmentID
WHERE       d.DepartmentName = 'Delete';

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[(6, 'Delete', 5), (6, 'Delete', 13)]

Bây giờ bài toán sẽ là xóa phòng Delete và chuyển nhân viên vào phòng Chờ:

In [49]:
%%sql
INSERT INTO Department (DepartmentName)
SELECT 'Phòng chờ'
FROM    dual
WHERE NOT EXISTS (
    SELECT 1
    FROM Department
    WHERE DepartmentName = 'Phòng chờ'
);

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [10]:
%%sql
DROP    PROCEDURE   IF EXISTS   sp_DeleteDeptByName;
CREATE  PROCEDURE               sp_DeleteDeptByName(
    IN      p_DeptName          NVARCHAR(50)
)
BEGIN
    DECLARE v_RemoveFromDeptID  TINYINT UNSIGNED;
    DECLARE v_MovetoDeptID      TINYINT UNSIGNED;

    SELECT  DepartmentID    INTO v_RemoveFromDeptID
    FROM    Department
    WHERE   DepartmentName = p_DeptName;

    INSERT INTO Department (DepartmentName)
    SELECT 'Phòng chờ'
    FROM    dual
    WHERE NOT EXISTS (
        SELECT  1
        FROM    Department
        WHERE   DepartmentName = 'Phòng chờ'
        );
    
    SELECT  DepartmentID    INTO v_MovetoDeptID
    FROM    Department
    WHERE   DepartmentName = 'Phòng chờ';

    IF  v_RemoveFromDeptID IS NOT NULL THEN
        UPDATE  Account
        SET     DepartmentID    = v_MovetoDeptID
        WHERE   DepartmentID    = v_RemoveFromDeptID;

        DELETE
        FROM    Department
        WHERE   DepartmentID    = v_RemoveFromDeptID;

        SELECT  CONCAT('Department ', p_DeptName, ' has been deleted!') AS MESSAGE;
    ELSE
        SELECT  CONCAT('Department ', p_DeptName, ' does not exist!')   AS MESSAGE;
    END IF;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [11]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

cursor.callproc('sp_DeleteDeptByName', ('Delete',))

result = cursor.fetchall()
print(result)

while cursor.nextset():
    pass
conn.commit()

cursor.close()
conn.close()

(('Department Delete has been deleted!',),)

In [12]:
%%sql
SELECT      d.DepartmentID, d.DepartmentName, a.AccountID
FROM        Department  AS d
RIGHT JOIN  Account     AS a    ON a.DepartmentID = d.DepartmentID
WHERE       d.DepartmentName = 'Delete';

 * mysql://root:***@localhost/testing_system_db
0 rows affected.

[]

In [13]:
%%sql
SELECT      d.DepartmentID, d.DepartmentName, a.AccountID
FROM        Department  AS d
RIGHT JOIN  Account     AS a    ON a.DepartmentID = d.DepartmentID
WHERE       d.DepartmentName = 'Phòng chờ';

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[(7, 'Phòng chờ', 5), (7, 'Phòng chờ', 13)]

Sau khi test xong, ta chuyển 2 nhân viên này về lại phòng ban cũ:

In [16]:
%%sql
UPDATE  Account
SET     DepartmentID = 4
WHERE   DepartmentID = 7;

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[]

# Question 12: Viết Store để in ra mỗi tháng có bao nhiêu câu hỏi được tạo trong năm nay

In [20]:
%%sql
SELECT      MONTH(CreateDate) AS MONTH, COUNT(QuestionID) AS NUM_QUESTION
FROM        Question
WHERE       YEAR(CreateDate) = '2024'
GROUP BY    MONTH;

 * mysql://root:***@localhost/testing_system_db
2 rows affected.

[(3, 8), (4, 10)]

In [21]:
%%sql
DROP    PROCEDURE IF EXISTS sp_CountQuestionByMonth;
CREATE  PROCEDURE           sp_CountQuestionByMonth()
BEGIN
    SELECT      MONTH(CreateDate) AS MONTH, COUNT(QuestionID) AS NUM_QUESTION
    FROM        Question
    WHERE       YEAR(CreateDate) = YEAR(CURRENT_DATE())
    GROUP BY    MONTH;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [25]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

cursor.callproc('sp_CountQuestionByMonth')

result = cursor.fetchall()
for record in result:
    print(record)

cursor.close()
conn.close()

(3, 8)
(4, 10)

# Question 13: Viết Store để in ra Mỗi tháng có bao nhiêu Câu hỏi được tạo trong 6 tháng gần đây nhất (Nếu tháng nào không có thì sẽ in ra là "không có câu hỏi nào trong tháng")

Tạo bảng tạm chứa các tháng trong năm:

In [34]:
%%sql
DROP    TEMPORARY TABLE IF EXISTS   temp_MonthsOfYear;
CREATE  TEMPORARY TABLE             temp_MonthsOfYear(
    v_Month INT
);

INSERT INTO temp_MonthsOfYear   (v_Month)
VALUES                          (1), (2), (3), (4), (5), (6), (7), (8), (9), (10), (11), (12);

SELECT  *
FROM    temp_MonthsOfYear;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.
12 rows affected.
12 rows affected.

[(1,), (2,), (3,), (4,), (5,), (6,), (7,), (8,), (9,), (10,), (11,), (12,)]

In [41]:
%%sql
SELECT      t.v_Month AS MONTH, COUNT(q.QuestionID) AS NUM_QUESTION
FROM        temp_MonthsOfYear   AS t
LEFT JOIN   Question            AS q    ON MONTH(q.CreateDate) = t.v_Month
AND         YEAR(q.CreateDate) = YEAR(CURRENT_DATE())
GROUP BY    t.v_Month;

 * mysql://root:***@localhost/testing_system_db
12 rows affected.

[(1, 0),
 (2, 0),
 (3, 8),
 (4, 10),
 (5, 0),
 (6, 0),
 (7, 0),
 (8, 0),
 (9, 0),
 (10, 0),
 (11, 0),
 (12, 0)]

In [58]:
%%sql
SELECT      t.v_Month AS MONTH, 
            CASE
                WHEN COUNT(q.QuestionID) = 0 THEN 'Không có câu hỏi nào trong tháng'
                ELSE COUNT(q.QuestionID)
            END AS NUM_QUESTION
FROM        temp_MonthsOfYear   AS t
LEFT JOIN   Question            AS q    ON MONTH(q.CreateDate) = t.v_Month
AND         YEAR(q.CreateDate) = YEAR(CURRENT_DATE())
GROUP BY    t.v_Month;

 * mysql://root:***@localhost/testing_system_db
12 rows affected.

[(1, 'Không có câu hỏi nào trong tháng'),
 (2, 'Không có câu hỏi nào trong tháng'),
 (3, '8'),
 (4, '10'),
 (5, 'Không có câu hỏi nào trong tháng'),
 (6, 'Không có câu hỏi nào trong tháng'),
 (7, 'Không có câu hỏi nào trong tháng'),
 (8, 'Không có câu hỏi nào trong tháng'),
 (9, 'Không có câu hỏi nào trong tháng'),
 (10, 'Không có câu hỏi nào trong tháng'),
 (11, 'Không có câu hỏi nào trong tháng'),
 (12, 'Không có câu hỏi nào trong tháng')]

In [61]:
%%sql
INSERT INTO Question (`Content`			  , CategoryID    , TypeID	 , CreatorID    , CreateDate    )
VALUES               (N'Câu hỏi thử nghiệm', 3             , 2         , 3           , '2023-12-01' );

 * mysql://root:***@localhost/testing_system_db
1 rows affected.

[]

In [65]:
%%sql
SELECT      YEAR(CreateDate) AS YEAR, MONTH(CreateDATE) AS MONTH, COUNT(QuestionID) AS NUM_QUESTION
FROM        Question
GROUP BY    YEAR(CreateDate), MONTH(CreateDATE)
ORDER BY    YEAR(CreateDate);

 * mysql://root:***@localhost/testing_system_db
3 rows affected.

[(2023, 12, 1), (2024, 3, 8), (2024, 4, 10)]

In [15]:
%%sql
DROP PROCEDURE IF EXISTS sp_CreateLastSixMonthsTable;
CREATE PROCEDURE         sp_CreateLastSixMonthsTable()     
BEGIN
    DECLARE v_Count INT DEFAULT 0;
    DECLARE v_Month INT;

    DROP    TEMPORARY TABLE IF EXISTS   temp_LastSixMonths;
    CREATE  TEMPORARY TABLE             temp_LastSixMonths(
        Month INT
    );

    WHILE v_Count < 6 DO
        SET     v_Month = MONTH(DATE_SUB(NOW(), INTERVAL v_Count MONTH));
        INSERT  INTO temp_LastSixMonths (Month) 
        VALUES                          (v_Month);
        SET     v_Count = v_Count + 1;
    END WHILE;

    SELECT      *
    FROM        temp_LastSixMonths; 
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [16]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

cursor.callproc('sp_CreateLastSixMonthsTable')

result = cursor.fetchall()
for record in result:
    print(record)

cursor.close()
conn.close()

(5,)
(4,)
(3,)
(2,)
(1,)
(12,)

In [18]:
%%sql
DROP PROCEDURE IF EXISTS sp_CountQuestionLastSixMonths;
CREATE PROCEDURE         sp_CountQuestionLastSixMonths()     
BEGIN
    DECLARE v_Count INT DEFAULT 0;
    DECLARE v_Month INT;

    DROP    TEMPORARY TABLE IF EXISTS   temp_LastSixMonths;
    CREATE  TEMPORARY TABLE             temp_LastSixMonths(
        Month INT
    );

    WHILE v_Count < 6 DO
        SET     v_Month = MONTH(DATE_SUB(NOW(), INTERVAL v_Count MONTH));
        INSERT  INTO temp_LastSixMonths (Month) 
        VALUES                          (v_Month);
        SET     v_Count = v_Count + 1;
    END WHILE;

    SELECT      t.Month AS MONTH,
                CASE
                    WHEN COUNT(q.QuestionID) = 0 THEN 'Không có câu hỏi nào trong tháng'
                    ELSE COUNT(q.QuestionID)
                END AS NUM_QUESTION
    FROM        temp_LastSixMonths  AS  t
    LEFT JOIN   Question            AS  q ON MONTH(q.CreateDate) = t.Month
    AND         q.CreateDate > DATE_SUB(NOW(), INTERVAL 6 MONTH) 
    AND         q.CreateDate <= NOW()
    GROUP BY    t.Month;
END;

 * mysql://root:***@localhost/testing_system_db
0 rows affected.
0 rows affected.

[]

In [19]:
import MySQLdb
conn = MySQLdb.connect(host='localhost', user='root', password='root', database='testing_system_db')
cursor = conn.cursor()

cursor.callproc('sp_CountQuestionLastSixMonths')

result = cursor.fetchall()
for record in result:
    print(record)

cursor.close()
conn.close()

(5, 'Không có câu hỏi nào trong tháng')
(4, '10')
(3, '8')
(2, 'Không có câu hỏi nào trong tháng')
(1, 'Không có câu hỏi nào trong tháng')
(12, '1')